pesp-was8.5-ext-srcs/tests/test_files/soap/EPLS_testSearch_ExclusionType_req.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:impl="http://impl.services.screening.medicaid.gov/">
   <soapenv:Header/>
   <soapenv:Body>
      <impl:search>
         <arg0>
            <firstName>Alice</firstName>
            <exclusionType>
               <name>NonProcurement</name>
            </exclusionType>
         </arg0>
      </impl:search>
   </soapenv:Body>
</soapenv:Envelope>